#include "stc12c5a.h"
#include "LCD12864.h" 


//unsigned char code user16x16[]={ //笑脸图片
//0x0F,0xF0,0x10,0x08,0x20,0x04,0x40,0x02,0x9C,0x39,0xBE,0x7D,0x80,0x01,0x80,0x01,
//0x80,0x01,0x88,0x11,0x84,0x21,0x43,0xC2,0x20,0x04,0x10,0x08,0x0F,0xF0,0x00,0x00,
//};


/******************************************************************************
 * DelayUs2x: 
 * 函数原型: - 
 * 函数功能: 
 * 输入参数: 
 * 输出参数: 
 * 编写日期：   2014/04/13, ChenxianLong create this function
 ******************************************************************************/
void DelayUs2x(unsigned char t)
{ unsigned char i;  
 while(--t)
 {
 for(i=0;i<6;i++)
  ;
 }
}
/*------------------------------------------------
 mS延时函数，含有输入参数 unsigned char t，无返回值
 unsigned char 是定义无符号字符变量，其值的范围是
 0~255 这里使用晶振12M，精确延时请使用汇编
------------------------------------------------*/
/******************************************************************************
 * DelaynMs: 
 * 函数原型: - 
 * 函数功能: 
 * 输入参数: 
 * 输出参数: 
 * 编写日期：   2014/04/13, ChenxianLong create this function
 ******************************************************************************/
void DelaynMs(unsigned char t)
{
     
 while(t--)
 {
     //大致延时1mS
     DelayUs2x(245);
  DelayUs2x(245);
 }
}

/******************************************************************************
 * Delays: 
 * 函数原型: - 
 * 函数功能: 
 * 输入参数: 
 * 输出参数: 
 * 编写日期：   2014/04/13, ChenxianLong create this function
 ******************************************************************************/
void Delays(unsigned int t)
{
     
 while(t--)
 {
     //大致延时1mS
     DelayUs2x(245);
  DelayUs2x(245);
 }
}
/*------------------------------------------------
                    检测忙位
------------------------------------------------*/
/******************************************************************************
 * Check_Busy: 
 * 函数原型: - 
 * 函数功能: 
 * 输入参数: 
 * 输出参数: 
 * 编写日期：   2014/04/13, ChenxianLong create this function
 ******************************************************************************/
void Check_Busy()
{  
    RS=0;
    RW=1;
    E=1;
    DataPort=0xff;
    while((DataPort&0x80)==0x80);//忙则等待
    E=0;
}
/*------------------------------------------------
                   写命令
------------------------------------------------*/
/******************************************************************************
 * Write_Cmd: 
 * 函数原型: - 
 * 函数功能: 
 * 输入参数: 
 * 输出参数: 
 * 编写日期：   2014/04/13, ChenxianLong create this function
 ******************************************************************************/
void Write_Cmd(unsigned char Cmd)
{
 Check_Busy();
 RS=0;
 RW=0;
 E=1;
 DataPort=Cmd;
 DelayUs2x(5);
 E=0;
 DelayUs2x(5);
}
/*------------------------------------------------
                    写数据
------------------------------------------------*/
/******************************************************************************
 * Write_Data: 
 * 函数原型: - 
 * 函数功能: 
 * 输入参数: 
 * 输出参数: 
 * 编写日期：   2014/04/13, ChenxianLong create this function
 ******************************************************************************/
void Write_Data(unsigned char Data)
{
 Check_Busy();
 RS=1;
 RW=0;
 E=1;
 DataPort=Data;
 DelayUs2x(5);
 E=0;
 DelayUs2x(5);
}
/*------------------------------------------------
                   液晶屏初始化
------------------------------------------------*/
/******************************************************************************
 * Init_ST7920: 
 * 函数原型: - 
 * 函数功能: 
 * 输入参数: 
 * 输出参数: 
 * 编写日期：   2014/04/13, ChenxianLong create this function
 ******************************************************************************/
void Init_ST7920()
{  

   DelaynMs(10);
   Write_Cmd(0x30);       //选择基本指令集
   DelayUs2x(50);         //延时大于100us
   Write_Cmd(0x30);       //选择8bit数据流
   DelayUs2x(20);         //延时大于37us
   Write_Cmd(0x0c);       //开显示(无游标、不反白)
   DelayUs2x(50);         //延时大于100us
   Write_Cmd(0x01);       //清除显示，并且设定地址指针为00H
   DelaynMs(15);           //延时大于10ms
   Write_Cmd(0x06);       //指定在资料的读取及写入时，设定游标的移动方向及指定显示的移位，光标从右向左加1位移动
   DelayUs2x(50);         //延时大于100us
}
/*------------------------------------------------
                   用户自定义字符
------------------------------------------------*/
/******************************************************************************
 * CGRAM: 
 * 函数原型: - 
 * 函数功能: 
 * 输入参数: 
 * 输出参数: 
 * 编写日期：   2014/04/13, ChenxianLong create this function
 ******************************************************************************/
void CGRAM()
{ 
     int i;

     Write_Cmd(0x30); 
     Write_Cmd(0x40);
     for(i=0;i<16;i++)
       {
//        Write_Data(user16x16[i*2]);
 //       Write_Data(user16x16[i*2+1]);
      }
}   
/*------------------------------------------------
                   显示用户自定义字符
------------------------------------------------*/
/******************************************************************************
 * DisplayCGRAM: 
 * 函数原型: - 
 * 函数功能: 
 * 输入参数: 
 * 输出参数: 
 * 编写日期：   2014/04/13, ChenxianLong create this function
 ******************************************************************************/
void DisplayCGRAM(unsigned char x,unsigned char y)
{ 
 switch(y)
     {
   case 1: Write_Cmd(0x80+x);break;
   case 2: Write_Cmd(0x90+x);break;
   case 3: Write_Cmd(0x88+x);break;
   case 4: Write_Cmd(0x98+x);break;
      default:break;
  }
    Write_Data(00);
    Write_Data(00);

}         
/*------------------------------------------------
                   显示字符串
x:横坐标值，范围0~8
y:纵坐标值，范围1~4
------------------------------------------------*/
/******************************************************************************
 * LCD_PutString: 
 * 函数原型: - 
 * 函数功能: 
 * 输入参数: 
 * 输出参数: 
 * 编写日期：   2014/04/13, ChenxianLong create this function
 ******************************************************************************/
void LCD_PutString(unsigned char x,unsigned char y,unsigned char code *s)
{ 
 switch(y)
     {
   case 1: Write_Cmd(0x80+x);break;
   case 2: Write_Cmd(0x90+x);break;
   case 3: Write_Cmd(0x88+x);break;
   case 4: Write_Cmd(0x98+x);break;
      default:break;
  }
 while(*s>0)
   { 
      Write_Data(*s);
      s++;
      DelayUs2x(250);
   }
}
/*------------------------------------------------
                      清屏
------------------------------------------------*/
/******************************************************************************
 * ClrScreen: 
 * 函数原型: - 
 * 函数功能: 
 * 输入参数: 
 * 输出参数: 
 * 编写日期：   2014/04/13, ChenxianLong create this function
 ******************************************************************************/
void ClrScreen()
{ 
   Write_Cmd(0x01);
   DelaynMs(15);
}
    

/******************************************************************************
 * 函数原型: -LCD_PutGraphic 
 * 函数功能: 
 * 输入参数: 
 * 输出参数: 
 * 编写日期：   2014/04/13, ChenxianLong create this function
 ******************************************************************************/
void LCD_PutGraphic(unsigned char code *img)
{ 
 int i,j;
//显示上半屏内容设置
   for(i=0;i<32;i++)            
    { 
      Write_Cmd(0x80 + i); //SET  垂直地址 VERTICAL ADD
      Write_Cmd(0x80);     //SET  水平地址 HORIZONTAL ADD
      for(j=0;j<16;j++)
       {
         Write_Data(*img);
         img++;
       }
    }
//显示下半屏内容设置
   for(i=0;i<32;i++)            
    {
      Write_Cmd(0x80 + i); //SET 垂直地址 VERTICAL ADD
      Write_Cmd(0x88);     //SET 水平地址 HORIZONTAL ADD
      for(j=0;j<16;j++)
       {
         Write_Data(*img);
         img++;
       }
    }  
           
}
/*------------------------------------------------
                 设置到绘图模式
------------------------------------------------*/

/******************************************************************************
 * 函数原型: -SetGraphicMode 
 * 函数功能: 
 * 输入参数: 
 * 输出参数: 
 * 编写日期：   2014/04/13, ChenxianLong create this function
 ******************************************************************************/
void SetGraphicMode()
{ 
   Write_Cmd(0x36);       //选择8bit数据流 图形模式
   DelayUs2x(20);

}